# Cable Size Comments Property

Source: https://www.revitapidocs.com/2026/b7e2b05e-c2ef-ebe4-b1e7-0e91db3f4a40.htm

---

| Cable Size Comments Property |
| --- |

The comments of this Cable Size.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public string Comments { get; set; }
```

```
Public Property Comments As String
	Get
	Set
```

```
public:
property String^ Comments {
	String^ get ();
	void set (String^ value);
}
```

```
member Comments : string with get, set
```

#### Property Value

String Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

CableSize Class Autodesk.Revit.DB.Electrical Namespace